mrnoise/MicroTrait/MSP430/GPIO/Gpio.hpp
    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *P0SEL, volatile auto *P1SEL>
    struct PortSel0and1WithoutPull {

      private:
        MT::Universal::Register<INREG>  m_in{};
        MT::Universal::Register<OUTREG> m_out{};
        MT::Universal::Register<DIRREG> m_dir{};
        MT::Universal::Register<P0SEL>  m_p0sel{};
        MT::Universal::Register<P1SEL>  m_p1sel{};

      public:
        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsOutputPin(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
#ifdef MT_MSP430_USE_DRIVERLIB_COMPATIBILITY
            m_p0sel.clear(bit);
            m_p1sel.clear(bit);
#endif
            m_dir.set(bit);
        }


        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsInputPin(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
#ifdef MT_MSP430_USE_DRIVERLIB_COMPATIBILITY
            m_p0sel.clear(bit);
            m_p1sel.clear(bit);
#endif
            m_dir.clear(bit);
        }


        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsPeripheralModuleFunctionOutputPin(const MODULE_FUNC func, const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
            m_dir.set(bit);
            switch (func) {
                case MODULE_FUNC::GPIO:
                    m_p0sel.clear(bit);
                    m_p1sel.clear(bit);
                    break;
                case MODULE_FUNC::PRIMARY:
                    m_p0sel.set(bit);
                    m_p1sel.clear(bit);
                    break;
                case MODULE_FUNC::SECONDARY:
                    m_p0sel.clear(bit);
                    m_p1sel.set(bit);
                    break;
                case MODULE_FUNC::TERNARY:
                    m_p0sel.set(bit);
                    m_p1sel.set(bit);
                    break;
                default:
                    break;
            }
        }

        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsPeripheralModuleFunctionInputPin(const MODULE_FUNC func, const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
            m_dir.clear(bit);
            switch (func) {
                case MODULE_FUNC::GPIO:
                    m_p0sel.clear(bit);
                    m_p1sel.clear(bit);
                    break;
                case MODULE_FUNC::PRIMARY:
                    m_p0sel.set(bit);
                    m_p1sel.clear(bit);
                    break;
                case MODULE_FUNC::SECONDARY:
                    m_p0sel.clear(bit);
                    m_p1sel.set(bit);
                    break;
                case MODULE_FUNC::TERNARY:
                    m_p0sel.set(bit);
                    m_p1sel.set(bit);
                    break;
                default:
                    break;
            }
        }
    };


    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *PRENREG, volatile auto *P0SEL>
    struct PortSelOnly0 {

      private:
        MT::Universal::Register<INREG>   m_in{};
        MT::Universal::Register<OUTREG>  m_out{};
        MT::Universal::Register<DIRREG>  m_dir{};
        MT::Universal::Register<PRENREG> m_pull{};
        MT::Universal::Register<P0SEL>   m_p0sel{};

      public:
        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsOutputPin(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
#ifdef MT_MSP430_USE_DRIVERLIB_COMPATIBILITY
            m_p0sel.clear(bit);
#endif
            m_dir.set(bit);
        }


        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsInputPin(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
#ifdef MT_MSP430_USE_DRIVERLIB_COMPATIBILITY
            m_p0sel.clear(bit);
#endif
            m_dir.clear(bit);
            m_pull.clear(bit);
        }

        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsPeripheralModuleFunctionOutputPin(const MODULE_FUNC func, const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
            m_dir.set(bit);
            switch (func) {
                case MODULE_FUNC::GPIO:
                    m_p0sel.clear(bit);
                    break;
                case MODULE_FUNC::PRIMARY:
                    m_p0sel.set(bit);
                    break;
                case MODULE_FUNC::SECONDARY:
                    m_p0sel.clear(bit);
                    break;
                case MODULE_FUNC::TERNARY:
                    m_p0sel.set(bit);
                    break;
                default:
                    break;
            }
        }

        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsPeripheralModuleFunctionInputPin(const MODULE_FUNC func, const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
            m_dir.clear(bit);
            switch (func) {
                case MODULE_FUNC::GPIO:
                    m_p0sel.clear(bit);
                    break;
                case MODULE_FUNC::PRIMARY:
                    m_p0sel.set(bit);
                    break;
                case MODULE_FUNC::SECONDARY:
                    m_p0sel.clear(bit);
                    break;
                case MODULE_FUNC::TERNARY:
                    m_p0sel.set(bit);
                    break;
                default:
                    break;
            }
        }

        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsInputPinWithPullDown(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
#ifdef MT_MSP430_USE_DRIVERLIB_COMPATIBILITY
            m_p0sel.clear(bit);
#endif
            m_dir.clear(bit);
            m_pull.set(bit);
            m_out.clear(bit);
        }

        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsInputPinWithPullUp(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
#ifdef MT_MSP430_USE_DRIVERLIB_COMPATIBILITY
            m_p0sel.clear(bit);
#endif
            m_dir.clear(bit);
            m_pull.set(bit);
            m_out.set(bit);
        }
    };


