mrnoise/MicroTrait/MSP430/GPIO/Gpio.hpp
    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *PRENREG>
    struct PortNoSel {

      private:
        MT::Universal::Register<INREG>   m_in{};
        MT::Universal::Register<OUTREG>  m_out{};
        MT::Universal::Register<DIRREG>  m_dir{};
        MT::Universal::Register<PRENREG> m_pull{};

      public:
        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsOutputPin(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
            m_dir.set(bit);
        }


        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsInputPin(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
            m_dir.clear(bit);
            m_pull.clear(bit);
        }

        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsInputPinWithPullDown(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
            m_dir.clear(bit);
            m_pull.set(bit);
            m_out.clear(bit);
        }

        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void setAsInputPinWithPullUp(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
            m_dir.clear(bit);
            m_pull.set(bit);
            m_out.set(bit);
        }
    };


    template<volatile auto *IESREG, volatile auto *IEREG, volatile auto *IFGREG>
    struct PortInt {

      private:
        MT::Universal::Register<IESREG> m_intEdge{};
        MT::Universal::Register<IEREG>  m_intEn{};
        MT::Universal::Register<IFGREG> m_intFlg{};

      public:
        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief enables for the given pins the Interrupt -> Port must be interrupt capable (normally Port1/2)
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.enableInterrupt(GPIO::PIN::P0 | GPIO::PIN::P1); \endcode
		*@tparam BIT use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void enableInterrupt(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
            m_intEn.set(bit);
        }

        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief disables for the given pins the Interrupt -> Port must be interrupt capable (normally Port1/2)
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.disableInterrupt(GPIO::PIN::P0 | GPIO::PIN::P1); \endcode
		*@tparam BIT use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void disableInterrupt(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
            m_intEn.clear(bit);
        }

        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief compares the given pins with the interrupt flags set in the hw register -> Port must be interrupt capable (normally Port1/2)
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  if(p1.getInterruptStatus(GPIO::PIN::P0) == INT_MASK_MATCH::TRUE) doSomething(); \endcode
		*@tparam BIT use enumeration GPIO::PIN
		*@return if all the given bits are set or not (INT_MASK_MATCH)
		****************************************************************
		*/
        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        [[nodiscard]] constexpr INT_MASK_MATCH getInterruptStatus(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
            if (m_intFlg.compare(bit)) return INT_MASK_MATCH::TRUE;
            else
                return INT_MASK_MATCH::FALSE;
        }

        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief clears the interrupt flags for the given Pins  -> Port must be interrupt capable (normally Port1/2)
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.clearInterrupt(GPIO::PIN::P0 | GPIO::PIN::P1); \endcode
		*@tparam BIT use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void clearInterrupt(const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
            m_intFlg.clear(bit);
        }

        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief selects the interrupt edge (high or low going edge) for the given Pins -> Port must be interrupt capable (normally Port1/2)
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.selectInterruptEdge(GPIO::INT_EDGE::HIGH_TO_LOW, GPIO::PIN::P0 | GPIO::PIN::P1);  \endcode
		*@tparam BIT use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = std::enable_if_t<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>>
        constexpr void selectInterruptEdge(const INT_EDGE edge, const BIT &bit) noexcept {
            static_assert(compareBareType<MT::MSP430::GPIO::PIN, BIT>(), "input must be GPIO::PIN enum");
            if (edge == INT_EDGE::LOW_TO_HIGH) m_intEdge.clear(bit);
            else
                m_intEdge.set(bit);
        }
    };

