mrnoise/MicroTrait/MSP430/GPIO/Gpio.hpp
#if defined(__MSP430_HAS_PORT2_R__) || defined(__MSP430_HAS_PORT2__)
#if defined(P2IES) && defined(P2IE) && defined(P2IFG) && defined(P2SEL0) && defined(P2SEL1) && defined(P2REN) && defined(P2DS)
using Port2 = Internal::PortWithIntDrv<&P2IN, &P2OUT, &P2DIR, &P2REN, &P2SEL0, &P2SEL1, &P2IES, &P2IE, &P2IFG, &P2DS>;
#elif defined(P2IES) && defined(P2IE) && defined(P2IFG) && defined(P2SEL0) && defined(P2SEL1) && defined(P2REN)
using Port2  = Internal::PortWithInt<&P2IN, &P2OUT, &P2DIR, &P2REN, &P2SEL0, &P2SEL1, &P2IES, &P2IE, &P2IFG>;
#elif defined(P2IES) && defined(P2IE) && defined(P2IFG) && defined(P2SEL0) && defined(P2SEL1) && defined(P2DS)
using Port2  = Internal::PortWithIntNoPullDrv<&P2IN, &P2OUT, &P2DIR, &P2SEL0, &P2SEL1, &P2IES, &P2IE, &P2IFG, &P2DS>;
#elif defined(P2IES) && defined(P2IE) && defined(P2IFG) && defined(P2SEL0) && defined(P2SEL1)
using Port2  = Internal::PortWithIntNoPull<&P2IN, &P2OUT, &P2DIR, &P2SEL0, &P2SEL1, &P2IES, &P2IE, &P2IFG>;
#elif defined(P2IES) && defined(P2IE) && defined(P2IFG) && defined(P2REN) && defined(P2DS)
using Port2  = Internal::PortWithIntSel0Drv<&P2IN, &P2OUT, &P2DIR, &P2REN, &P2SEL0, &P2IES, &P2IE, &P2IFG, &P2DS>;
#elif defined(P2IES) && defined(P2IE) && defined(P2IFG) && defined(P2REN)
using Port2  = Internal::PortWithIntSel0<&P2IN, &P2OUT, &P2DIR, &P2REN, &P2SEL0, &P2IES, &P2IE, &P2IFG>;
#elif defined(P2SEL0) && defined(P2SEL1) && defined(P2REN) && defined(P2DS)
using Port2  = Internal::PortDrv<&P2IN, &P2OUT, &P2DIR, &P2REN, &P2SEL0, &P2SEL1, &P2DS>;
#elif defined(P2SEL0) && defined(P2SEL1) && defined(P2REN)
using Port2  = Internal::Port<&P2IN, &P2OUT, &P2DIR, &P2REN, &P2SEL0, &P2SEL1>;
#elif defined(P2SEL0) && defined(P2REN) && defined(P2DS)
using Port2  = Internal::PortSel0Drv<&P2IN, &P2OUT, &P2DIR, &P2REN, &P2SEL0, &P2DS>;
#elif defined(P2SEL0) && defined(P2REN)
using Port2  = Internal::PortSel0<&P2IN, &P2OUT, &P2DIR, &P2REN, &P2SEL0>;
#endif
#endif


#if defined(__MSP430_HAS_PORT3_R__) || defined(__MSP430_HAS_PORT3__)
#if defined(P3IES) && defined(P3IE) && defined(P3IFG) && defined(P3SEL0) && defined(P3SEL1) && defined(P3REN) && defined(P3DS)
using Port3 = Internal::PortWithIntDrv<&P3IN, &P3OUT, &P3DIR, &P3REN, &P3SEL0, &P3SEL1, &P3IES, &P3IE, &P3IFG, &P3DS>;
#elif defined(P3IES) && defined(P3IE) && defined(P3IFG) && defined(P3SEL0) && defined(P3SEL1) && defined(P3REN)
using Port3  = Internal::PortWithInt<&P3IN, &P3OUT, &P3DIR, &P3REN, &P3SEL0, &P3SEL1, &P3IES, &P3IE, &P3IFG>;
#elif defined(P3IES) && defined(P3IE) && defined(P3IFG) && defined(P3SEL0) && defined(P3SEL1) && defined(P3DS)
using Port3  = Internal::PortWithIntNoPullDrv<&P3IN, &P3OUT, &P3DIR, &P3SEL0, &P3SEL1, &P3IES, &P3IE, &P3IFG, &P3DS>;
#elif defined(P3IES) && defined(P3IE) && defined(P3IFG) && defined(P3SEL0) && defined(P3SEL1)
using Port3  = Internal::PortWithIntNoPull<&P3IN, &P3OUT, &P3DIR, &P3SEL0, &P3SEL1, &P3IES, &P3IE, &P3IFG>;
#elif defined(P3IES) && defined(P3IE) && defined(P3IFG) && defined(P3REN) && defined(P3DS)
using Port3  = Internal::PortWithIntSel0Drv<&P3IN, &P3OUT, &P3DIR, &P3REN, &P3SEL0, &P3IES, &P3IE, &P3IFG, &P3DS>;
#elif defined(P3IES) && defined(P3IE) && defined(P3IFG) && defined(P3REN)
using Port3  = Internal::PortWithIntSel0<&P3IN, &P3OUT, &P3DIR, &P3REN, &P3SEL0, &P3IES, &P3IE, &P3IFG>;
#elif defined(P3SEL0) && defined(P3SEL1) && defined(P3REN) && defined(P3DS)
using Port3  = Internal::PortDrv<&P3IN, &P3OUT, &P3DIR, &P3REN, &P3SEL0, &P3SEL1, &P3DS>;
#elif defined(P3SEL0) && defined(P3SEL1) && defined(P3REN)
using Port3  = Internal::Port<&P3IN, &P3OUT, &P3DIR, &P3REN, &P3SEL0, &P3SEL1>;
#elif defined(P3SEL0) && defined(P3REN) && defined(P3DS)
using Port3  = Internal::PortSel0Drv<&P3IN, &P3OUT, &P3DIR, &P3REN, &P3SEL0, &P3DS>;
#elif defined(P3SEL0) && defined(P3REN)
using Port3  = Internal::PortSel0<&P3IN, &P3OUT, &P3DIR, &P3REN, &P3SEL0>;
#endif
#endif


#if defined(__MSP430_HAS_PORT4_R__) || defined(__MSP430_HAS_PORT4__)
#if defined(P4IES) && defined(P4IE) && defined(P4IFG) && defined(P4SEL0) && defined(P4SEL1) && defined(P4REN) && defined(P4DS)
using Port4 = Internal::PortWithIntDrv<&P4IN, &P4OUT, &P4DIR, &P4REN, &P4SEL0, &P4SEL1, &P4IES, &P4IE, &P4IFG, &P4DS>;
#elif defined(P4IES) && defined(P4IE) && defined(P4IFG) && defined(P4SEL0) && defined(P4SEL1) && defined(P4REN)
using Port4  = Internal::PortWithInt<&P4IN, &P4OUT, &P4DIR, &P4REN, &P4SEL0, &P4SEL1, &P4IES, &P4IE, &P4IFG>;
#elif defined(P4IES) && defined(P4IE) && defined(P4IFG) && defined(P4SEL0) && defined(P4SEL1) && defined(P4DS)
using Port4  = Internal::PortWithIntNoPullDrv<&P4IN, &P4OUT, &P4DIR, &P4SEL0, &P4SEL1, &P4IES, &P4IE, &P4IFG, &P4DS>;
#elif defined(P4IES) && defined(P4IE) && defined(P4IFG) && defined(P4SEL0) && defined(P4SEL1)
using Port4  = Internal::PortWithIntNoPull<&P4IN, &P4OUT, &P4DIR, &P4SEL0, &P4SEL1, &P4IES, &P4IE, &P4IFG>;
#elif defined(P4IES) && defined(P4IE) && defined(P4IFG) && defined(P4REN) && defined(P4DS)
using Port4  = Internal::PortWithIntSel0Drv<&P4IN, &P4OUT, &P4DIR, &P4REN, &P4SEL0, &P4IES, &P4IE, &P4IFG, &P4DS>;
#elif defined(P4IES) && defined(P4IE) && defined(P4IFG) && defined(P4REN)
using Port4  = Internal::PortWithIntSel0<&P4IN, &P4OUT, &P4DIR, &P4REN, &P4SEL0, &P4IES, &P4IE, &P4IFG>;
#elif defined(P4SEL0) && defined(P4SEL1) && defined(P4REN) && defined(P4DS)
using Port4  = Internal::PortDrv<&P4IN, &P4OUT, &P4DIR, &P4REN, &P4SEL0, &P4SEL1, &P4DS>;
#elif defined(P4SEL0) && defined(P4SEL1) && defined(P4REN)
using Port4  = Internal::Port<&P4IN, &P4OUT, &P4DIR, &P4REN, &P4SEL0, &P4SEL1>;
#elif defined(P4SEL0) && defined(P4REN) && defined(P4DS)
using Port4  = Internal::PortSel0Drv<&P4IN, &P4OUT, &P4DIR, &P4REN, &P4SEL0, &P4DS>;
#elif defined(P4SEL0) && defined(P4REN)
using Port4  = Internal::PortSel0<&P4IN, &P4OUT, &P4DIR, &P4REN, &P4SEL0>;
#endif
#endif


#if defined(__MSP430_HAS_PORT5_R__) || defined(__MSP430_HAS_PORT5__)
#if defined(P5IES) && defined(P5IE) && defined(P5IFG) && defined(P5SEL0) && defined(P5SEL1) && defined(P5REN) && defined(P5DS)
using Port5 = Internal::PortWithIntDrv<&P5IN, &P5OUT, &P5DIR, &P5REN, &P5SEL0, &P5SEL1, &P5IES, &P5IE, &P5IFG, &P5DS>;
#elif defined(P5IES) && defined(P5IE) && defined(P5IFG) && defined(P5SEL0) && defined(P5SEL1) && defined(P5REN)
using Port5  = Internal::PortWithInt<&P5IN, &P5OUT, &P5DIR, &P5REN, &P5SEL0, &P5SEL1, &P5IES, &P5IE, &P5IFG>;
#elif defined(P5IES) && defined(P5IE) && defined(P5IFG) && defined(P5SEL0) && defined(P5SEL1) && defined(P5DS)
using Port5  = Internal::PortWithIntNoPullDrv<&P5IN, &P5OUT, &P5DIR, &P5SEL0, &P5SEL1, &P5IES, &P5IE, &P5IFG, &P5DS>;
#elif defined(P5IES) && defined(P5IE) && defined(P5IFG) && defined(P5SEL0) && defined(P5SEL1)
using Port5  = Internal::PortWithIntNoPull<&P5IN, &P5OUT, &P5DIR, &P5SEL0, &P5SEL1, &P5IES, &P5IE, &P5IFG>;
#elif defined(P5IES) && defined(P5IE) && defined(P5IFG) && defined(P5REN) && defined(P5DS)
using Port5  = Internal::PortWithIntSel0Drv<&P5IN, &P5OUT, &P5DIR, &P5REN, &P5SEL0, &P5IES, &P5IE, &P5IFG, &P5DS>;
#elif defined(P5IES) && defined(P5IE) && defined(P5IFG) && defined(P5REN)
using Port5  = Internal::PortWithIntSel0<&P5IN, &P5OUT, &P5DIR, &P5REN, &P5SEL0, &P5IES, &P5IE, &P5IFG>;
#elif defined(P5SEL0) && defined(P5SEL1) && defined(P5REN) && defined(P5DS)
using Port5  = Internal::PortDrv<&P5IN, &P5OUT, &P5DIR, &P5REN, &P5SEL0, &P5SEL1, &P5DS>;
#elif defined(P5SEL0) && defined(P5SEL1) && defined(P5REN)
using Port5  = Internal::Port<&P5IN, &P5OUT, &P5DIR, &P5REN, &P5SEL0, &P5SEL1>;
#elif defined(P5SEL0) && defined(P5REN) && defined(P5DS)
using Port5  = Internal::PortSel0Drv<&P5IN, &P5OUT, &P5DIR, &P5REN, &P5SEL0, &P5DS>;
#elif defined(P5SEL0) && defined(P5REN)
using Port5  = Internal::PortSel0<&P5IN, &P5OUT, &P5DIR, &P5REN, &P5SEL0>;
#endif
#endif


#if defined(__MSP430_HAS_PORT6_R__) || defined(__MSP430_HAS_PORT6__)
#if defined(P6IES) && defined(P6IE) && defined(P6IFG) && defined(P6SEL0) && defined(P6SEL1) && defined(P6REN) && defined(P6DS)
using Port6 = Internal::PortWithIntDrv<&P6IN, &P6OUT, &P6DIR, &P6REN, &P6SEL0, &P6SEL1, &P6IES, &P6IE, &P6IFG, &P6DS>;
#elif defined(P6IES) && defined(P6IE) && defined(P6IFG) && defined(P6SEL0) && defined(P6SEL1) && defined(P6REN)
using Port6  = Internal::PortWithInt<&P6IN, &P6OUT, &P6DIR, &P6REN, &P6SEL0, &P6SEL1, &P6IES, &P6IE, &P6IFG>;
#elif defined(P6IES) && defined(P6IE) && defined(P6IFG) && defined(P6SEL0) && defined(P6SEL1) && defined(P6DS)
using Port6  = Internal::PortWithIntNoPullDrv<&P6IN, &P6OUT, &P6DIR, &P6SEL0, &P6SEL1, &P6IES, &P6IE, &P6IFG, &P6DS>;
#elif defined(P6IES) && defined(P6IE) && defined(P6IFG) && defined(P6SEL0) && defined(P6SEL1)
using Port6  = Internal::PortWithIntNoPull<&P6IN, &P6OUT, &P6DIR, &P6SEL0, &P6SEL1, &P6IES, &P6IE, &P6IFG>;
#elif defined(P6IES) && defined(P6IE) && defined(P6IFG) && defined(P6REN) && defined(P6DS)
using Port6  = Internal::PortWithIntSel0Drv<&P6IN, &P6OUT, &P6DIR, &P6REN, &P6SEL0, &P6IES, &P6IE, &P6IFG, &P6DS>;
#elif defined(P6IES) && defined(P6IE) && defined(P6IFG) && defined(P6REN)
using Port6  = Internal::PortWithIntSel0<&P6IN, &P6OUT, &P6DIR, &P6REN, &P6SEL0, &P6IES, &P6IE, &P6IFG>;
#elif defined(P6SEL0) && defined(P6SEL1) && defined(P6REN) && defined(P6DS)
using Port6  = Internal::PortDrv<&P6IN, &P6OUT, &P6DIR, &P6REN, &P6SEL0, &P6SEL1, &P6DS>;
#elif defined(P6SEL0) && defined(P6SEL1) && defined(P6REN)
using Port6  = Internal::Port<&P6IN, &P6OUT, &P6DIR, &P6REN, &P6SEL0, &P6SEL1>;
#elif defined(P6SEL0) && defined(P6REN) && defined(P6DS)
using Port6  = Internal::PortSel0Drv<&P6IN, &P6OUT, &P6DIR, &P6REN, &P6SEL0, &P6DS>;
#elif defined(P6SEL0) && defined(P6REN)
using Port6  = Internal::PortSel0<&P6IN, &P6OUT, &P6DIR, &P6REN, &P6SEL0>;
#endif
#endif


#if defined(__MSP430_HAS_PORT7_R__) || defined(__MSP430_HAS_PORT7__)
#if defined(P7IES) && defined(P7IE) && defined(P7IFG) && defined(P7SEL0) && defined(P7SEL1) && defined(P7REN) && defined(P7DS)
using Port7 = Internal::PortWithIntDrv<&P7IN, &P7OUT, &P7DIR, &P7REN, &P7SEL0, &P7SEL1, &P7IES, &P7IE, &P7IFG, &P7DS>;
#elif defined(P7IES) && defined(P7IE) && defined(P7IFG) && defined(P7SEL0) && defined(P7SEL1) && defined(P7REN)
using Port7  = Internal::PortWithInt<&P7IN, &P7OUT, &P7DIR, &P7REN, &P7SEL0, &P7SEL1, &P7IES, &P7IE, &P7IFG>;
#elif defined(P7IES) && defined(P7IE) && defined(P7IFG) && defined(P7SEL0) && defined(P7SEL1) && defined(P7DS)
using Port7  = Internal::PortWithIntNoPullDrv<&P7IN, &P7OUT, &P7DIR, &P7SEL0, &P7SEL1, &P7IES, &P7IE, &P7IFG, &P7DS>;
#elif defined(P7IES) && defined(P7IE) && defined(P7IFG) && defined(P7SEL0) && defined(P7SEL1)
using Port7  = Internal::PortWithIntNoPull<&P7IN, &P7OUT, &P7DIR, &P7SEL0, &P7SEL1, &P7IES, &P7IE, &P7IFG>;
#elif defined(P7IES) && defined(P7IE) && defined(P7IFG) && defined(P7REN) && defined(P7DS)
using Port7  = Internal::PortWithIntSel0Drv<&P7IN, &P7OUT, &P7DIR, &P7REN, &P7SEL0, &P7IES, &P7IE, &P7IFG, &P7DS>;
#elif defined(P7IES) && defined(P7IE) && defined(P7IFG) && defined(P7REN)
using Port7  = Internal::PortWithIntSel0<&P7IN, &P7OUT, &P7DIR, &P7REN, &P7SEL0, &P7IES, &P7IE, &P7IFG>;
#elif defined(P7SEL0) && defined(P7SEL1) && defined(P7REN) && defined(P7DS)
using Port7  = Internal::PortDrv<&P7IN, &P7OUT, &P7DIR, &P7REN, &P7SEL0, &P7SEL1, &P7DS>;
#elif defined(P7SEL0) && defined(P7SEL1) && defined(P7REN)
using Port7  = Internal::Port<&P7IN, &P7OUT, &P7DIR, &P7REN, &P7SEL0, &P7SEL1>;
#elif defined(P7SEL0) && defined(P7REN) && defined(P7DS)
using Port7  = Internal::PortSel0Drv<&P7IN, &P7OUT, &P7DIR, &P7REN, &P7SEL0, &P7DS>;
#elif defined(P7SEL0) && defined(P7REN)
using Port7  = Internal::PortSel0<&P7IN, &P7OUT, &P7DIR, &P7REN, &P7SEL0>;
#endif
#endif


#if defined(__MSP430_HAS_PORT8_R__) || defined(__MSP430_HAS_PORT8__)
#if defined(P8IES) && defined(P8IE) && defined(P8IFG) && defined(P8SEL0) && defined(P8SEL1) && defined(P8REN) && defined(P8DS)
using Port8 = Internal::PortWithIntDrv<&P8IN, &P8OUT, &P8DIR, &P8REN, &P8SEL0, &P8SEL1, &P8IES, &P8IE, &P8IFG, &P8DS>;
#elif defined(P8IES) && defined(P8IE) && defined(P8IFG) && defined(P8SEL0) && defined(P8SEL1) && defined(P8REN)
using Port8  = Internal::PortWithInt<&P8IN, &P8OUT, &P8DIR, &P8REN, &P8SEL0, &P8SEL1, &P8IES, &P8IE, &P8IFG>;
#elif defined(P8IES) && defined(P8IE) && defined(P8IFG) && defined(P8SEL0) && defined(P8SEL1) && defined(P8DS)
using Port8  = Internal::PortWithIntNoPullDrv<&P8IN, &P8OUT, &P8DIR, &P8SEL0, &P8SEL1, &P8IES, &P8IE, &P8IFG, &P8DS>;
#elif defined(P8IES) && defined(P8IE) && defined(P8IFG) && defined(P8SEL0) && defined(P8SEL1)
using Port8  = Internal::PortWithIntNoPull<&P8IN, &P8OUT, &P8DIR, &P8SEL0, &P8SEL1, &P8IES, &P8IE, &P8IFG>;
#elif defined(P8IES) && defined(P8IE) && defined(P8IFG) && defined(P8REN) && defined(P8DS)
using Port8  = Internal::PortWithIntSel0Drv<&P8IN, &P8OUT, &P8DIR, &P8REN, &P8SEL0, &P8IES, &P8IE, &P8IFG, &P8DS>;
#elif defined(P8IES) && defined(P8IE) && defined(P8IFG) && defined(P8REN)
using Port8  = Internal::PortWithIntSel0<&P8IN, &P8OUT, &P8DIR, &P8REN, &P8SEL0, &P8IES, &P8IE, &P8IFG>;
#elif defined(P8SEL0) && defined(P8SEL1) && defined(P8REN) && defined(P8DS)
using Port8  = Internal::PortDrv<&P8IN, &P8OUT, &P8DIR, &P8REN, &P8SEL0, &P8SEL1, &P8DS>;
#elif defined(P8SEL0) && defined(P8SEL1) && defined(P8REN)
using Port8  = Internal::Port<&P8IN, &P8OUT, &P8DIR, &P8REN, &P8SEL0, &P8SEL1>;
#elif defined(P8SEL0) && defined(P8REN) && defined(P8DS)
using Port8  = Internal::PortSel0Drv<&P8IN, &P8OUT, &P8DIR, &P8REN, &P8SEL0, &P8DS>;
#elif defined(P8SEL0) && defined(P8REN)
using Port8  = Internal::PortSel0<&P8IN, &P8OUT, &P8DIR, &P8REN, &P8SEL0>;
#endif
#endif


#if defined(__MSP430_HAS_PORT9_R__) || defined(__MSP430_HAS_PORT9__)
#if defined(P9IES) && defined(P9IE) && defined(P9IFG) && defined(P9SEL0) && defined(P9SEL1) && defined(P9REN) && defined(P9DS)
using Port9 = Internal::PortWithIntDrv<&P9IN, &P9OUT, &P9DIR, &P9REN, &P9SEL0, &P9SEL1, &P9IES, &P9IE, &P9IFG, &P9DS>;
#elif defined(P9IES) && defined(P9IE) && defined(P9IFG) && defined(P9SEL0) && defined(P9SEL1) && defined(P9REN)
using Port9  = Internal::PortWithInt<&P9IN, &P9OUT, &P9DIR, &P9REN, &P9SEL0, &P9SEL1, &P9IES, &P9IE, &P9IFG>;
#elif defined(P9IES) && defined(P9IE) && defined(P9IFG) && defined(P9SEL0) && defined(P9SEL1) && defined(P9DS)
using Port9  = Internal::PortWithIntNoPullDrv<&P9IN, &P9OUT, &P9DIR, &P9SEL0, &P9SEL1, &P9IES, &P9IE, &P9IFG, &P9DS>;
#elif defined(P9IES) && defined(P9IE) && defined(P9IFG) && defined(P9SEL0) && defined(P9SEL1)
using Port9  = Internal::PortWithIntNoPull<&P9IN, &P9OUT, &P9DIR, &P9SEL0, &P9SEL1, &P9IES, &P9IE, &P9IFG>;
#elif defined(P9IES) && defined(P9IE) && defined(P9IFG) && defined(P9REN) && defined(P9DS)
using Port9  = Internal::PortWithIntSel0Drv<&P9IN, &P9OUT, &P9DIR, &P9REN, &P9SEL0, &P9IES, &P9IE, &P9IFG, &P9DS>;
#elif defined(P9IES) && defined(P9IE) && defined(P9IFG) && defined(P9REN)
using Port9  = Internal::PortWithIntSel0<&P9IN, &P9OUT, &P9DIR, &P9REN, &P9SEL0, &P9IES, &P9IE, &P9IFG>;
#elif defined(P9SEL0) && defined(P9SEL1) && defined(P9REN) && defined(P9DS)
using Port9  = Internal::PortDrv<&P9IN, &P9OUT, &P9DIR, &P9REN, &P9SEL0, &P9SEL1, &P9DS>;
#elif defined(P9SEL0) && defined(P9SEL1) && defined(P9REN)
using Port9  = Internal::Port<&P9IN, &P9OUT, &P9DIR, &P9REN, &P9SEL0, &P9SEL1>;
#elif defined(P9SEL0) && defined(P9REN) && defined(P9DS)
using Port9  = Internal::PortSel0Drv<&P9IN, &P9OUT, &P9DIR, &P9REN, &P9SEL0, &P9DS>;
#elif defined(P9SEL0) && defined(P9REN)
using Port9  = Internal::PortSel0<&P9IN, &P9OUT, &P9DIR, &P9REN, &P9SEL0>;
#endif
#endif


#if defined(__MSP430_HAS_PORT10_R__) || defined(__MSP430_HAS_PORT10__)
#if defined(P10IES) && defined(P10IE) && defined(P10IFG) && defined(P10SEL0) && defined(P10SEL1) && defined(P10REN) && defined(P10DS)
using Port10 = Internal::PortWithIntDrv<&P10IN, &P10OUT, &P10DIR, &P10REN, &P10SEL0, &P10SEL1, &P10IES, &P10IE, &P10IFG, &P10DS>;
#elif defined(P10IES) && defined(P10IE) && defined(P10IFG) && defined(P10SEL0) && defined(P10SEL1) && defined(P10REN)
using Port10 = Internal::PortWithInt<&P10IN, &P10OUT, &P10DIR, &P10REN, &P10SEL0, &P10SEL1, &P10IES, &P10IE, &P10IFG>;
#elif defined(P10IES) && defined(P10IE) && defined(P10IFG) && defined(P10SEL0) && defined(P10SEL1) && defined(P10DS)
using Port10 = Internal::PortWithIntNoPullDrv<&P10IN, &P10OUT, &P10DIR, &P10SEL0, &P10SEL1, &P10IES, &P10IE, &P10IFG, &P10DS>;
#elif defined(P10IES) && defined(P10IE) && defined(P10IFG) && defined(P10SEL0) && defined(P10SEL1)
using Port10 = Internal::PortWithIntNoPull<&P10IN, &P10OUT, &P10DIR, &P10SEL0, &P10SEL1, &P10IES, &P10IE, &P10IFG>;
#elif defined(P10IES) && defined(P10IE) && defined(P10IFG) && defined(P10REN) && defined(P10DS)
using Port10 = Internal::PortWithIntSel0Drv<&P10IN, &P10OUT, &P10DIR, &P10REN, &P10SEL0, &P10IES, &P10IE, &P10IFG, &P10DS>;
#elif defined(P10IES) && defined(P10IE) && defined(P10IFG) && defined(P10REN)
using Port10 = Internal::PortWithIntSel0<&P10IN, &P10OUT, &P10DIR, &P10REN, &P10SEL0, &P10IES, &P10IE, &P10IFG>;
#elif defined(P10SEL0) && defined(P10SEL1) && defined(P10REN) && defined(P10DS)
using Port10 = Internal::PortDrv<&P10IN, &P10OUT, &P10DIR, &P10REN, &P10SEL0, &P10SEL1, &P10DS>;
#elif defined(P10SEL0) && defined(P10SEL1) && defined(P10REN)
using Port10 = Internal::Port<&P10IN, &P10OUT, &P10DIR, &P10REN, &P10SEL0, &P10SEL1>;
#elif defined(P10SEL0) && defined(P10REN) && defined(P10DS)
using Port10 = Internal::PortSel0Drv<&P10IN, &P10OUT, &P10DIR, &P10REN, &P10SEL0, &P10DS>;
#elif defined(P10SEL0) && defined(P10REN)
using Port10 = Internal::PortSel0<&P10IN, &P10OUT, &P10DIR, &P10REN, &P10SEL0>;
#endif
#endif


#if defined(__MSP430_HAS_PORT11_R__) || defined(__MSP430_HAS_PORT11__)
#if defined(P11IES) && defined(P11IE) && defined(P11IFG) && defined(P11SEL0) && defined(P11SEL1) && defined(P11REN) && defined(P11DS)
using Port11 = Internal::PortWithIntDrv<&P11IN, &P11OUT, &P11DIR, &P11REN, &P11SEL0, &P11SEL1, &P11IES, &P11IE, &P11IFG, &P11DS>;
#elif defined(P11IES) && defined(P11IE) && defined(P11IFG) && defined(P11SEL0) && defined(P11SEL1) && defined(P11REN)
using Port11 = Internal::PortWithInt<&P11IN, &P11OUT, &P11DIR, &P11REN, &P11SEL0, &P11SEL1, &P11IES, &P11IE, &P11IFG>;
#elif defined(P11IES) && defined(P11IE) && defined(P11IFG) && defined(P11SEL0) && defined(P11SEL1) && defined(P11DS)
using Port11 = Internal::PortWithIntNoPullDrv<&P11IN, &P11OUT, &P11DIR, &P11SEL0, &P11SEL1, &P11IES, &P11IE, &P11IFG, &P11DS>;
#elif defined(P11IES) && defined(P11IE) && defined(P11IFG) && defined(P11SEL0) && defined(P11SEL1)
using Port11 = Internal::PortWithIntNoPull<&P11IN, &P11OUT, &P11DIR, &P11SEL0, &P11SEL1, &P11IES, &P11IE, &P11IFG>;
#elif defined(P11IES) && defined(P11IE) && defined(P11IFG) && defined(P11REN) && defined(P11DS)
using Port11 = Internal::PortWithIntSel0Drv<&P11IN, &P11OUT, &P11DIR, &P11REN, &P11SEL0, &P11IES, &P11IE, &P11IFG, &P11DS>;
#elif defined(P11IES) && defined(P11IE) && defined(P11IFG) && defined(P11REN)
using Port11 = Internal::PortWithIntSel0<&P11IN, &P11OUT, &P11DIR, &P11REN, &P11SEL0, &P11IES, &P11IE, &P11IFG>;
#elif defined(P11SEL0) && defined(P11SEL1) && defined(P11REN) && defined(P11DS)
using Port11 = Internal::PortDrv<&P11IN, &P11OUT, &P11DIR, &P11REN, &P11SEL0, &P11SEL1, &P11DS>;
#elif defined(P11SEL0) && defined(P11SEL1) && defined(P11REN)
using Port11 = Internal::Port<&P11IN, &P11OUT, &P11DIR, &P11REN, &P11SEL0, &P11SEL1>;
#elif defined(P11SEL0) && defined(P11REN) && defined(P11DS)
using Port11 = Internal::PortSel0Drv<&P11IN, &P11OUT, &P11DIR, &P11REN, &P11SEL0, &P11DS>;
#elif defined(P11SEL0) && defined(P11REN)
using Port11 = Internal::PortSel0<&P11IN, &P11OUT, &P11DIR, &P11REN, &P11SEL0>;
#endif
#endif


#if defined(__MSP430_HAS_PORTJ_R__) || defined(__MSP430_HAS_PORTJ__)
#if defined(__MSP430FR5XX_6XX_FAMILY__) || defined(__MSP430FR57XX_FAMILY__)
using PortJ = Internal::Port<&PJIN, &PJOUT, &PJDIR, &PJREN, &PJSEL0, &PJSEL1>;
#elif defined(__MSP430F5XX_6XX_FAMILY__)
using PortJ  = Internal::PortSelOffDrv<&PJIN, &PJOUT, &PJDIR, &PJREN, &PJDS>;
#endif
#endif

}// namespace MT::MSP430::GPIO

#endif
#endif /* MICROTRAIT_MSP430_GPIO_GPIO_HPP_ */
